app/controllers/chapas_controller.rb

SELECT * FROM `chapas`
---
  def index
    @chapas = Chapa.all

SELECT * FROM `chapas` WHERE (`chapas`.`id` = 1)
---
  def show
    @chapa = Chapa.find(params[:id])

SELECT * FROM `chapas` WHERE (`chapas`.`id` = 1)
---
  def edit
    @chapa = Chapa.find(params[:id])

INSERT INTO `chapas` (`created_at`, `nome`, `updated_at`) VALUES('2010-05-16 12:41:08', 'Chapa 1 - Palharini e Bruno', '2010-05-16 12:41:08')
---
  def create
    @chapa = Chapa.new(params[:chapa])

    respond_to do |format|
      if @chapa.save

SELECT * FROM `chapas` WHERE (`chapas`.`id` = 1)
UPDATE `chapas` SET `updated_at` = '2010-05-21 14:30:11', `nome` = 'Palharini e Bruno' WHERE `id` = 1
---
  def update
    @chapa = Chapa.find(params[:id])

    respond_to do |format|
      if @chapa.update_attributes(params[:chapa])