app/controllers/graficos_chapas_controller.rb

  def index
    ###################################################### POR CHAPA
    @graficos_chapas = {}
    chapas = Chapa.all.each
    total = 0
    chapas.each do |chapa|
      total = RegistroDeVoto.sum('id', :conditions => ["chapa_id = ?", chapa.id])
---
SELECT * FROM `chapas`
SELECT sum(`registro_de_votos`.id) AS sum_id FROM `registro_de_votos` WHERE (chapa_id = 1)

  def swf_por_chapa
    chapa = Chapa.find(params[:idchapa])

    barra_docentes = Bar.new(50, '#DD0000')
    barra_docentes.key('Docentes', 14)

    barra_tecnicos = Bar.new(50, '#00AA00')
    barra_tecnicos.key('Técnico ADM', 14)

    barra_alunos = Bar.new(50, '#0000AA')
    barra_alunos.key('Alunos', 14)

    y_maximo = 5000

    registros_de_voto = RegistroDeVoto.all(:conditions => ["chapa_id = ?", chapa.id])
---
SELECT * FROM `chapas` WHERE (`chapas`.`id` = 2)
SELECT * FROM `registro_de_votos` WHERE (chapa_id = 2)