app/controllers/graficos_locais_controller.rb

SELECT * FROM `locals` ORDER BY nome ASC, mesa DESC
SELECT * FROM `chapas`
SELECT sum(`registro_de_votos`.id) AS sum_id FROM `registro_de_votos` WHERE (local_id = 1 and chapa_id = 1)
---
  def index
    ####################################################### POR LOCAL
    @graficos_locais = {}
    locais = Local.find(:all, :order => "nome ASC")
    locais.each do |local|
      puts "PROCESSANDOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO:#{local.nome}"
      chapas = Chapa.all
      total = 0
      chapas.each do |chapa|
        total = RegistroDeVoto.sum('id', :conditions => ["local_id = ? and chapa_id = ?", local.id, chapa.id])

SELECT * FROM `locals` WHERE (`locals`.`id` = 1)
SELECT * FROM `chapas`
SELECT * FROM `locals`
SELECT * FROM `registro_de_votos` WHERE (local_id = 1 and chapa_id = 1)
---
  def swf_por_local
    local = Local.find(params[:idlocal])

    barra_docentes = Bar.new(50, '#DD0000')
    barra_docentes.key('Docentes', 20)

    barra_tecnicos = Bar.new(50, '#00AA00')
    barra_tecnicos.key('Técnico ADM', 20)

    barra_alunos = Bar.new(50, '#0000AA')
    barra_alunos.key('Alunos', 20)

    chapas = Chapa.all

    y_maximo = 0
    chapas.each do |chapa|
      registros_de_voto = RegistroDeVoto.all(:conditions => ["local_id = ? and chapa_id = ?", local.id, chapa.id])