app/controllers/graficos_categorias_controller.rb

SELECT sum(votos_tecnicoadm_abstinencia + votos_tecnicoadm_abstinencia + votos_tecnicoadm_abstinencia) AS sum_votos_tecnicoadm_abstinencia_votos_tecnicoadm_abstinencia_votos_tecnicoadm_abstinencia FROM `registro_de_votos`
---
  def index
    ####################################################### POR CATEGORIA
    @graficos_categorias = {}

    @graficos_categorias['Docentes'] = open_flash_chart_object(240,400, '/graficos/swf_por_categoria?idcategoria=docentes', true)
    @graficos_categorias['Alunos'] = open_flash_chart_object(240,400, '/graficos/swf_por_categoria?idcategoria=alunos', true)
    @graficos_categorias['Técnicos ADM'] = open_flash_chart_object(240,400, '/graficos/swf_por_categoria?idcategoria=tecnicos', true)

    @total_brancos_alunos = RegistroDeVoto.sum('votos_alunos_brancos + votos_tecnicoadm_brancos + votos_docentes_brancos')

SELECT * FROM `chapas`
SELECT * FROM `registro_de_votos` WHERE (chapa_id = 1)
---
  def swf_por_categoria

    barra_validos = Bar.new(80, '#000000')

    if(params['idcategoria'] == 'docentes')
      barra_validos = Bar.new(70, '#DD0000')
    else
      if (params['idcategoria'] == 'alunos')
        barra_validos = Bar.new(60, '#0000AA')
      else
        if (params['idcategoria'] == 'tecnicos')
          barra_validos = Bar.new(60, '#00AA00')
        end
      end
    end

    barra_validos.key('Votos válidos', 14)

    chapas = Chapa.all

    y_maximo = 0
    chapas.each do |chapa|
      registros_de_voto = RegistroDeVoto.all(:conditions => ["chapa_id = ?", chapa.id])