app/controllers/home_controller.rb

  def index
    ###################################################### GERAL
    @graficos_gerais = {}
    total = RegistroDeVoto.sum('id')
    if total > 0
      @graficos_gerais["Somatório Geral"] = open_flash_chart_object(600,400, '/graficos/geral', true)
    else
      @graficos_gerais["Somatório Geral"] = "Nenhum registro de voto"
    end

    @total_validos = RegistroDeVoto.sum('votos_alunos + votos_tecnicoadm + votos_docentes')
    @total_brancos = RegistroDeVoto.sum('votos_alunos_brancos + votos_tecnicoadm_brancos + votos_docentes_brancos')
    @total_nulos = RegistroDeVoto.sum('votos_alunos_nulos + votos_tecnicoadm_nulos + votos_docentes_nulos')
    @total_abstencoes = RegistroDeVoto.sum('votos_alunos_abstinencia + votos_tecnicoadm_abstinencia + votos_docentes_abstinencia')

    @votos_apurados = @total_validos.to_i + @total_abstencoes.to_i + @total_nulos.to_i + @total_brancos.to_i
    @total_votos_possiveis = 2781 + 3886 + 29310

    @total_urnas = Local.count
---
SELECT sum(votos_alunos_abstinencia + votos_tecnicoadm_abstinencia + votos_docentes_abstinencia) AS sum_votos_alunos_abstinencia_votos_tecnicoadm_abstinencia_votos_docentes_abstinencia FROM `registro_de_votos`
SELECT count(*) AS count_all FROM `locals`

  def urnas_apuradas
    dados = []
    status_urna = []
    total_geral = 0

    status_urna << 'Apurada'
    status_urna << 'Não Apurada'

    total_urnas = Local.count
    total_urnas_apuradas = RegistroDeVoto.count(:local_id, :distinct => "true")
---
SELECT count(*) AS count_all FROM `locals`
SELECT count(DISTINCT `registro_de_votos`.local_id) AS count_local_id FROM `registro_de_votos`

  def geral
    chapas = Chapa.all
    dados = []
    nomes_chapas = []
    total_geral = 0

    chapas.each do |chapa|
      total_pontos_da_chapa = RegistroDeVoto.sum('(votos_docentes/2781) + (votos_tecnicoadm/3886) + (votos_alunos/29310)',
      :conditions => ["chapa_id = ?", chapa.id])
---
SELECT * FROM `chapas`
SELECT sum((votos_docentes/2781) + (votos_tecnicoadm/3886) + (votos_alunos/29310)) AS sum_votos_docentes_2781_votos_tecnicoadm_3886_votos_alunos_29310 FROM `registro_de_votos` WHERE (chapa_id = 1)