app/controllers/locals_controller.rb

  def index
    @locals = Local.all
---
SELECT * FROM `locals`

  def show
    @local = Local.find(params[:id])
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 1)

  def edit
    @local = Local.find(params[:id])
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 1)

  def create
    @local = Local.new(params[:local])

    respond_to do |format|
      if @local.save
---
INSERT INTO `locals` (`created_at`, `nome`, `updated_at`, `mesa`, `secao`) VALUES('2010-05-17 11:00:31', 'HUAP', '2010-05-17 11:00:31', 2, 2)

  def update
    @local = Local.find(params[:id])

    respond_to do |format|
      if @local.update_attributes(params[:local])
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 1)
UPDATE `locals` SET `updated_at` = '2010-05-17 11:00:06', `secao` = 2, `mesa` = 1 WHERE `id` = 1

  def destroy
    @local = Local.find(params[:id])
    @local.destroy
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 2)
DELETE FROM `locals` WHERE `id` = 2