app/controllers/registro_de_votos_controller.rb

  def index
    @registro_de_votos = RegistroDeVoto.all
---
SELECT * FROM `registro_de_votos` LIMIT 1

  def show
    @registro_de_voto = RegistroDeVoto.find(params[:id])
---
SELECT * FROM `registro_de_votos` WHERE (`registro_de_votos`.`id` = 1)

  def new
    @registro_de_voto = RegistroDeVoto.new
    @locais = Local.all
    @chapas = Chapa.all
---
SELECT * FROM `locals`
SELECT * FROM `chapas`

  def edit
    @registro_de_voto = RegistroDeVoto.find(params[:id])
---
SELECT * FROM `registro_de_votos` WHERE (`registro_de_votos`.`id` = 5)

  def create
    @registro_de_voto = RegistroDeVoto.new(params[:registro_de_voto])

#    puts @registro_de_voto.projeto

    respond_to do |format|
      if @registro_de_voto.save
---
INSERT INTO `registro_de_votos` (`votos_alunos_abstinencia`, `votos_docentes`, `created_at`, `votos_alunos_brancos`, `votos_docentes_nulos`, `updated_at`, `votos_docentes_brancos`, `votos_docentes_abstinencia`, `votos_tecnicoadm_nulos`, `chapa_id`, `votos_alunos_nulos`, `local_id`, `votos_tecnicoadm`, `votos_tecnicoadm_brancos`, `votos_tecnicoadm_abstinencia`, `votos_alunos`) VALUES(850, 100, '2010-05-21 02:35:41', 5, 20, '2010-05-21 02:35:41', 10, 300, 10, 2, 30, 1, 50, 20, 500, 20)

  def destroy
    @registro_de_voto = RegistroDeVoto.find(params[:id])
    @registro_de_voto.destroy
---
SELECT * FROM `registro_de_votos` WHERE (`registro_de_votos`.`id` = 5)
DELETE FROM `registro_de_votos` WHERE `id` = 5