app/controllers/usuarios_controller.rb

INSERT INTO `usuarios` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '607758ea54c641816a63a249876e3359e6afddcb', '2010-05-21 03:34:35', 'd20e44423a7989a35551ff096310310c1a4d3258', NULL, '2010-05-21 03:34:35', NULL, 'ntpadmin', 'thiagodiogo@gmail.com')
---
  def create
    logout_keeping_session!
    @usuario = Usuario.new(params[:usuario])
    success = @usuario && @usuario.save